<h3>1. Defining a Simple Function</h3>
Example 1a) Define a function to compute the area of a rectangle with width W and length L.

In [1]:
def area_rectangle(W,L):
    A=W*L
    return A

Example 1b) Check the function can be used to find the area A of a rectangle with width 5 and length 10.

In [2]:
area_rectangle(5,10)

50

<h4> PROBLEM ONE: </h4>

Problem 1a) Define a function caled area_triangle which takes inputs base B and height H and returns the area A of the triangle.

In [3]:
def area_triangle(B,H):
    A=.5*B*H
    return A

Problem 1b)  Check that your function works  on a triangle with base 10 and height 4.

In [4]:
area_triangle(10,4)

20.0

<h3> 2. Importing Data from the Chicago Data Portal</h3>

Example 2a) Public art data can be imported using the URL https://data.cityofchicago.org/resource/sj6t-9cju.json

 Import public art data from the data portal into a dataframe ART

In [5]:
import pandas as pd
ART = pd.read_json('https://data.cityofchicago.org/resource/sj6t-9cju.json?$limit=100000') #Import data directly from data portal

Example 2b) uses the shape command to display the number of rows and columns.

In [6]:
ART.shape

(194, 16)

Example 2c) Display the names of the columns

In [7]:
ART.columns

Index([':@computed_region_43wa_7qmu', ':@computed_region_6mkv_f3dw',
       ':@computed_region_awaf_s7ux', ':@computed_region_bdys_3d7i',
       ':@computed_region_rpca_8um6', ':@computed_region_vrxf_vc4k', 'art',
       'artist', 'latitude', 'location', 'longitude', 'owner', 'park_name',
       'park_number', 'x_coordinate', 'y_coordinate'],
      dtype='object')

Example 2d) Display the first two rows of data

In [8]:
ART.head(2)

,:@computed_region_43wa_7qmu,:@computed_region_6mkv_f3dw,:@computed_region_awaf_s7ux,:@computed_region_bdys_3d7i,:@computed_region_rpca_8um6,:@computed_region_vrxf_vc4k,art,artist,latitude,location,longitude,owner,park_name,park_number,x_coordinate,y_coordinate
0,49,22535,10,301,4,25,Interpreting Nature,Roman Villareal,41.906255,"{'latitude': '41.906255', 'longitude': '-87.69...",-87.69942,CPD,HUMBOLDT (BARON VON),219,1.156809e+06,1.909067e+06
1,16,4451,40,539,14,76,The Young Lincoln,Charles Keck,41.989775,"{'latitude': '41.989775', 'longitude': '-87.66...",-87.66944,CPD,SENN (NICHOLAS),227,1.164734e+06,1.939563e+06

<h4> PROBLEM TWO: </h4> 

Problem 2a) Data for Chicago Public Schools can be imported into a Jupyter Notebook using the URL
https://data.cityofchicago.org/resource/ngix-dc87.json

Import this data into a dataframe called CPS

In [9]:
import pandas as pd
CPS = pd.read_json('https://data.cityofchicago.org/resource/ngix-dc87.json?$limit=100000') #Import data directly from data portal

Problem 2b) Display the number of rows and columns.

In [10]:
CPS.shape

(651, 91)

Problem 2c) Display the names of the columns.

In [11]:
CPS.columns

Index(['address', 'attainment_sat_grade_11_school',
       'attainment_sat_grade_11_school_1', 'average_length_suspension',
       'average_length_suspension_1', 'average_length_suspension_2',
       'behavior_discipline_year', 'behavior_discipline_year_1',
       'blue_ribbon_award_year', 'chronic_truancy_pct', 'city',
       'college_enrollment_cps_pct', 'college_enrollment_cps_pct_1',
       'college_enrollment_school', 'college_enrollment_school_1',
       'college_persistence_cps_pct', 'college_persistence_cps_pct_1',
       'college_persistence_school', 'college_persistence_school_1',
       'cps_school_profile', 'creative_school_certification_1',
       'culture_climate_description', 'culture_climate_rating',
       'excelerate_award_gold_year', 'excellence_award_year', 'fax',
       'freshmen_on_track_cps_pct', 'freshmen_on_track_school',
       'graduation_4_year_cps_pct', 'graduation_4_year_cps_pct_1',
       'graduation_4_year_school', 'graduation_4_year_school_1',
       'graduation_5_year_cps_pct', 'graduation_5_year_cps_pct_1',
       'graduation_5_year_school', 'graduation_5_year_school_1',
       'healthy_school_certification', 'healthy_school_certification_1',
       'improvement_award_year', 'long_name', 'misconducts_to_suspensions',
       'misconducts_to_suspensions_1', 'misconducts_to_suspensions_2',
       'mobility_rate_pct', 'one_year_dropout_rate_avg',
       'one_year_dropout_rate_year', 'one_year_dropout_rate_year_1',
       'other_metrics_year_1', 'other_metrics_year_2',
       'parent_survey_results_year', 'phone', 'primary_category',
       'progress_report_year', 'progress_toward_graduation',
       'progress_toward_graduation_1', 'sat_grade_11_score_cps_avg',
       'sat_grade_11_score_school', 'school_id', 'school_latitude',
       'school_longitude', 'school_survey_ambitious',
       'school_survey_collaborative', 'school_survey_effective',
       'school_survey_involved', 'school_survey_safety',
       'school_survey_student_response', 'school_survey_student_response_1',
       'school_survey_supportive', 'school_survey_teacher_response',
       'school_survey_teacher_response_1', 'school_type', 'short_name',
       'spot_light_award_year', 'state', 'state_school_report_card',
       'student_attainment_description', 'student_attainment_rating',
       'student_attendance_avg_pct', 'student_attendance_year_2',
       'student_growth_description', 'student_growth_rating',
       'supportive_school_award', 'supportive_school_award_desc',
       'suspensions_per_100_students', 'suspensions_per_100_students_1',
       'suspensions_per_100_students_2', 'teacher_attendance_avg_pct',
       'teacher_attendance_year_1', 'teacher_attendance_year_2', 'website',
       'zip'],
      dtype='object')

Problem 2d) Display the first two rows of data

In [12]:
CPS.head(2)

,address,attainment_sat_grade_11_school,attainment_sat_grade_11_school_1,average_length_suspension,average_length_suspension_1,average_length_suspension_2,behavior_discipline_year,behavior_discipline_year_1,blue_ribbon_award_year,chronic_truancy_pct,...,supportive_school_award,supportive_school_award_desc,suspensions_per_100_students,suspensions_per_100_students_1,suspensions_per_100_students_2,teacher_attendance_avg_pct,teacher_attendance_year_1,teacher_attendance_year_2,website,zip
0,8331 S MACKINAW AVE,0.0,0.0,1.9 days,NaN,1.7 days,2020.0,2021.0,NaN,42.2,...,EMERGING,This school has developed an action plan to su...,4.1,NaN,0.0,89.0,93.6,82.6,{'url': 'https://newsullivan.cps.edu'},60617
1,744 E 103RD ST,0.0,0.0,2.0 days,NaN,1.7 days,2020.0,2021.0,NaN,40.1,...,ESTABLISHED,This school has put in place systems and struc...,0.6,NaN,0.0,89.0,94.2,85.9,{'url': 'https://wendellsmith.cps.edu'},60628

<h3> 3. Simplifying the Imported Dataset</h3>
Example 3a) Create a dataframe called artdf using the columns ['art','artist', 'park_name'] from the dataframe ART

In [13]:
artdf=ART[ ['art','artist', 'park_name'] ]

Example 3b) Display the first 5 rows of data

In [14]:
artdf.head(5)

                                 art           artist             park_name
0                Interpreting Nature  Roman Villareal  HUMBOLDT (BARON VON)
1                  The Young Lincoln     Charles Keck       SENN (NICHOLAS)
2          Kwa-Ma-Rolas (Totem Pole)    Haida Indians     LINCOLN (ABRAHAM)
3  Christopher Columbus and Fountain    Moses Ezekiel       ARRIGO (VICTOR)
4                Curve XXII (I Will)  Ellsworth Kelly     LINCOLN (ABRAHAM)

Example 3c) 
displays the different park names and how many art exhibits they have

In [15]:
artdf['park_name'].value_counts()

LINCOLN (ABRAHAM)                   53
GRANT (ULYSSES)                     33
BURNHAM (DANIEL)                    10
GARFIELD (JAMES)                     9
NORTHERLY ISLAND                     7
WASHINGTON (GEORGE)                  6
HUMBOLDT (BARON VON)                 6
OZ                                   4
NICHOLS (JOHN FOUNTAIN)              3
MIDWAY PLAISANCE                     3
UNION                                2
INDIAN BOUNDARY                      2
WICKER (CHARLES, JOEL)               2
CHICAGO WOMEN'S PARK AND GARDENS     2
KENNEDY (DENNIS)                     2
FULLER (MELVILLE)                    2
COMMERCIAL CLUB PGD. OF CHICAGO      1
JONQUIL                              1
GOMPERS (SAMUEL)                     1
GOUDY (WILLIAM) SQUARE               1
OWENS (JESSE)                        1
LOGAN SQUARE SKATE PARK              1
JACKSON (ANDREW)                     1
MARIANO (LOUIS)                      1
SENECA                               1
McKINLEY (WILLIAM)                   1
DEARBORN (HENRY)                     1
CANAL ORIGINS                        1
CONNORS (WILLIAM)                    1
PALMISANO (HENRY)                    1
                                    ..
OGDEN (WILLIAM)                      1
SUN YAT-SEN                          1
CORNELL (PAUL) SQUARE                1
TRUMBULL (LYMAN)                     1
TOM (PING) MEML.                     1
KING (MARTIN LUTHER, JR.)            1
BIXLER (RAY)                         1
MARQUETTE (JACQUES)                  1
PARK NO. 532                         1
HORNER (HENRY)                       1
PARK NO. 474                         1
LEGION                               1
SKINNER (MARK)                       1
OGDEN (WILLIAM) PLAZA                1
MERRIMAC                             1
HARRISON (CARTER)                    1
ARRIGO (VICTOR)                      1
WARREN (LAURENCE)                    1
PORTAGE                              1
WASHINGTON SQUARE                    1
WEST PULLMAN                         1
WARD (A. MONTGOMERY)                 1
MID-NORTH                            1
MONUMENT                             1
PARK NO. 554                         1
HERITAGE GREEN                       1
LOYOLA                               1
SENN (NICHOLAS)                      1
TOUHY (PATRICK)                      1
MOUNT GREENWOOD                      1
Name: park_name, Length: 64, dtype: int64

<h4> Problem Three </h4>

Problem 3a) Create a dataframe called cpsdf using the columns ['address','short_name', 'supportive_school_award'] from the dataframe CPS

In [16]:
cpsdf=CPS[['address','short_name', 'supportive_school_award']]

Problem 3b) Display the first 5 rows of data

In [17]:
cpsdf.head(5)

               address    short_name supportive_school_award
0  8331 S MACKINAW AVE  NEW SULLIVAN                EMERGING
1       744 E 103RD ST         SMITH             ESTABLISHED
2     5110 N DAMEN AVE   AMUNDSEN HS             ESTABLISHED
3      6634 W RAVEN ST        ONAHAN             ESTABLISHED
4     730 N PULASKI RD        ORR HS               NOT RATED

Problem 3c) Display the different supportive school awards and how many schools received each award

In [18]:
cpsdf['supportive_school_award'].value_counts()

EMERGING       240
ESTABLISHED    224
NOT RATED      129
EXEMPLARY       56
Name: supportive_school_award, dtype: int64

<h4> Problem Four</h4>

1) Go to the Individual Landmarks data at https://data.cityofchicago.org/Historic-Preservation/Individual-Landmarks/tdab-kixi/data


2) Use  'View Data' -> 'Export' -> 'SODA API' ->  copy the API endpoint

3) Import the data to a dataframe my_df using the API endpoint. Display the first 5 rows of the data.

4) Streamline the data to just the columns ["address","architect","date_built","landmark_name"] and put the results in my_df1

5) Use the command my_df1.to_excel("Lesson3.xlsx") to create an Excel file with th data.

6) Dpwnload the Excel file and submit a PDF of Lesson3.xlsx.

<h3>Example Solution</h3>

1) Go to the the Individual Landmarks data at https://data.cityofchicago.org/Historic-Preservation/Individual-Landmarks/tdab-kixi/data

    
2) https://data.cityofchicago.org/resource/tdab-kixi.json

In [20]:
#3)
import pandas as pd
my_df = pd.read_json('https://data.cityofchicago.org/resource/tdab-kixi.json?$limit=100000') #Import data directly from data portal
my_df.head()

,:@computed_region_43wa_7qmu,:@computed_region_6mkv_f3dw,:@computed_region_awaf_s7ux,:@computed_region_bdys_3d7i,:@computed_region_rpca_8um6,:@computed_region_vrxf_vc4k,address,architect,date_built,id,landmark_designation_date,landmark_name,latitude,location,longitude
0,40.0,22535.0,24.0,240.0,1.0,23.0,2543 - 2545 W Diversey Av,NaN,NaN,L-265,2008-07-30T07:00:00.000Z,Vassar Swiss Underwear Company Building,41.931627,"{'latitude': '41.9316266084', 'longitude': '-8...",-87.692100
1,10.0,4301.0,1.0,220.0,36.0,2.0,4122 S Ellis Av,Adler & Sullivan,1886,L- 89,1991-10-02T07:00:00.000Z,Mathilde Eliel House,41.819256,"{'latitude': '41.819255751', 'longitude': '-87...",-87.602788
2,10.0,14913.0,48.0,92.0,35.0,38.0,431 S Dearborn St,William LeBaron Jenney,1891,L-139,1978-07-07T07:00:00.000Z,Manhattan Building,41.876066,"{'latitude': '41.8760657234', 'longitude': '-8...",-87.628964
3,9.0,21194.0,12.0,25.0,40.0,1.0,100 W 33rd St,"Patton, Fisher & Miller",1901,L- 12,2004-05-26T07:00:00.000Z,Machinery Hall at Illinois Institute of Techno...,41.835161,"{'latitude': '41.8351614122', 'longitude': '-8...",-87.629221
4,9.0,21192.0,12.0,162.0,10.0,4.0,4726 S Dr Martin Luther King Jr Dr,Henry L. Newhouse,1903,L- 88,1979-03-21T08:00:00.000Z,Melissa Ann Elam House,41.808530,"{'latitude': '41.808529769', 'longitude': '-87...",-87.617204

In [22]:
#4)
my_df1=my_df[["address","architect","date_built","landmark_name"]]
my_df1.head()

,address,architect,date_built,landmark_name
0,2543 - 2545 W Diversey Av,NaN,NaN,Vassar Swiss Underwear Company Building
1,4122 S Ellis Av,Adler & Sullivan,1886,Mathilde Eliel House
2,431 S Dearborn St,William LeBaron Jenney,1891,Manhattan Building
3,100 W 33rd St,"Patton, Fisher & Miller",1901,Machinery Hall at Illinois Institute of Techno...
4,4726 S Dr Martin Luther King Jr Dr,Henry L. Newhouse,1903,Melissa Ann Elam House

In [23]:
my_df1.to_excel("Lesson3.xlsx")